### POSTTEST 4 DATA PREPROCESSING

### Import Package yang di gunakan

In [1]:
#import package matplotlib
import matplotlib.pyplot as plt
#import package seaborn
import seaborn as sns
#import package pandas
import pandas as pd
#import package numpy
import numpy as np
# untuk data split
from sklearn.model_selection import train_test_split #data test dan train
# untuk data transforming
from sklearn.preprocessing import StandardScaler #standarisasi
from sklearn.preprocessing import MinMaxScaler #normalisasi
# untuk data cleaning
from sklearn.impute import SimpleImputer #substitusi nilai
# untuk data encoding
from sklearn.preprocessing import OrdinalEncoder #ordinal encoder
from sklearn.preprocessing import OneHotEncoder #onehot encoder

### Membaca dataset 'Womens Clothing E-Commerce Reviews.csv'

In [2]:
df = pd.read_csv('Womens Clothing E-Commerce Reviews.csv')
df.head()

,Unnamed: 0,Clothing ID,Age,Title,Review Text,Rating,Recommended IND,Positive Feedback Count,Division Name,Department Name,Class Name
0,0,767,33,NaN,Absolutely wonderful - silky and sexy and comf...,4,1,0,Initmates,Intimate,Intimates
1,1,1080,34,NaN,Love this dress! it's sooo pretty. i happene...,5,1,4,General,Dresses,Dresses
2,2,1077,60,Some major design flaws,I had such high hopes for this dress and reall...,3,0,0,General,Dresses,Dresses
3,3,1049,50,My favorite buy!,"I love, love, love this jumpsuit. it's fun, fl...",5,1,0,General Petite,Bottoms,Pants
4,4,847,47,Flattering shirt,This shirt is very flattering to all due to th...,5,1,6,General,Tops,Blouses

### Melihat informasi yang terdapat di dataset

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 23486 entries, 0 to 23485
Data columns (total 11 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Unnamed: 0               23486 non-null  int64
 1   Clothing ID              23486 non-null  int64
 2   Age                      23486 non-null  int64
 3   Title                    19676 non-null  object
 4   Review Text              22641 non-null  object
 5   Rating                   23486 non-null  int64
 6   Recommended IND          23486 non-null  int64
 7   Positive Feedback Count  23486 non-null  int64
 8   Division Name            23472 non-null  object
 9   Department Name          23472 non-null  object
 10  Class Name               23472 non-null  object
dtypes: int64(6), object(5)
memory usage: 2.0+ MB

### Melihat jumlah record yang terdapat pada setiap atribut serta type data nya

In [4]:
df.isna().sum()

Unnamed: 0                    0
Clothing ID                   0
Age                           0
Title                      3810
Review Text                 845
Rating                        0
Recommended IND               0
Positive Feedback Count       0
Division Name                14
Department Name              14
Class Name                   14
dtype: int64

### Melihat panjang dari dataset

In [5]:
print(f'panjang dataset {len(df)} baris')

panjang dataset 23486 baris

### Membaca dataset 'bank-additional.csv'

In [6]:
df2 = pd.read_csv('bank-additional-full.csv')
df2.head()

  age;"job";"marital";"education";"default";"housing";"loan";"contact";"month";"day_of_week";"duration";"campaign";"pdays";"previous";"poutcome";"emp.var.rate";"cons.price.idx";"cons.conf.idx";"euribor3m";"nr.employed";"y"
0  56;"housemaid";"married";"basic.4y";"no";"no";...
1  57;"services";"married";"high.school";"unknown...
2  37;"services";"married";"high.school";"no";"ye...
3  40;"admin.";"married";"basic.6y";"no";"no";"no...
4  56;"services";"married";"high.school";"no";"no...

### Membaca dataset 'Country.csv'

In [7]:
df3 = pd.read_csv('Country.csv')
df3.head()

         date  cases  deaths
0  2020-01-21      1       0
1  2020-01-22      1       0
2  2020-01-23      1       0
3  2020-01-24      2       0
4  2020-01-25      3       0

### Membaca dataset 'Social_Network_Ads.csv'

In [8]:
df4 = pd.read_csv('Social_Network_Ads.csv')
df4.head()

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          0
4  15804002    Male   19            76000          0

# DATA SPLIT

### Menentukan data test dan data train
### X = Data
### y = Label
### Membagi data train dan data test dengan proporsi 70:30

In [9]:
X = df[['Title']]
y = df['Class Name']

X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=.3)

In [10]:
print(f'panjang data train {len(X_train)}',
      f'panjang label train {len(y_train)}',
      f'panjang data test {len(X_test)}',
      f'panjang label test {len(y_test)}',
      sep = '\n'
     )

panjang data train 16440
panjang label train 16440
panjang data test 7046
panjang label test 7046

# DATA TRANSFORMASI
### Data Normalisasi

In [11]:
dataset_normalisasi = df.copy()

In [12]:
scaler = MinMaxScaler()

normalize_dataset = scaler.fit_transform(dataset_normalisasi[['Rating','Recommended IND','Positive Feedback Count']])

normalize_dataset = pd.DataFrame(normalize_dataset)
normalize_dataset.rename(columns={ 0 :'Rating', 1 : 'Recommended IND', 2 : 'Positive Feedback Count'}, inplace=True)

normalize_dataset.head(5)

   Rating  Recommended IND  Positive Feedback Count
0    0.75              1.0                 0.000000
1    1.00              1.0                 0.032787
2    0.50              0.0                 0.000000
3    1.00              1.0                 0.000000
4    1.00              1.0                 0.049180

### Data Standarisasi

In [13]:
ss = StandardScaler()
Scaled_data = ss.fit_transform(df3[['cases', 'deaths']])
print("Nilai Sebelum Standarisasi : ")
print("Standar Deviasi : ", np.std(df3))
print("Nilai Setelah Standarisasi : ")
print("Standar Deviasi : ", np.std(Scaled_data))

Nilai Sebelum Standarisasi :
Standar Deviasi :  cases     3.197415e+07
deaths    3.522927e+05
dtype: float64
Nilai Setelah Standarisasi :
Standar Deviasi :  0.9999999999999999

C:\Users\ASUS\AppData\Local\Programs\Python\Python310\lib\site-packages\numpy\core\fromnumeric.py:3571: FutureWarning: The default value of numeric_only in DataFrame.std is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  return std(axis=axis, dtype=dtype, out=out, ddof=ddof, **kwargs)

# DATA CLEANING

In [14]:
dataset_ns = df.copy()

In [15]:
imputer_mean = SimpleImputer(strategy = 'mean')
imputer_median = SimpleImputer(strategy= 'median')
imputer_modus = SimpleImputer(strategy = 'most_frequent')

### Modus

In [16]:
dataset_ns['Title'] = imputer_modus.fit_transform(dataset_ns[['Title']])

dataset_ns.isna().sum()

Unnamed: 0                   0
Clothing ID                  0
Age                          0
Title                        0
Review Text                845
Rating                       0
Recommended IND              0
Positive Feedback Count      0
Division Name               14
Department Name             14
Class Name                  14
dtype: int64

### Mean

In [17]:
dataset_ns['Age'] = imputer_mean.fit_transform(dataset_ns[['Age']])

dataset_ns.isna().sum()

Unnamed: 0                   0
Clothing ID                  0
Age                          0
Title                        0
Review Text                845
Rating                       0
Recommended IND              0
Positive Feedback Count      0
Division Name               14
Department Name             14
Class Name                  14
dtype: int64

### Menghapus Record

In [18]:
dataset_ns.dropna(inplace=True)

dataset_ns.isna().sum()

Unnamed: 0                 0
Clothing ID                0
Age                        0
Title                      0
Review Text                0
Rating                     0
Recommended IND            0
Positive Feedback Count    0
Division Name              0
Department Name            0
Class Name                 0
dtype: int64

In [19]:
len(dataset_ns)

22628

### Menghapus Data Duplikat

In [20]:
dataset_duplicate = df2.copy()

dataset_duplicate.duplicated().sum()

12

In [21]:
dataset_duplicate.drop_duplicates(inplace=True)

dataset_duplicate.duplicated().sum()

0

# ENCODING

In [22]:
dataset_ordinal = df4.copy()
dataset_one_hot = df4.copy()

In [23]:
df4['Gender'].unique()

array(['Male', 'Female'], dtype=object)

### Ordinal Encoding

In [24]:
encoder_ordinal =OrdinalEncoder()

#encoding kan
dataset_ordinal['Gender'] = encoder_ordinal.fit_transform(dataset_ordinal[['Gender']]).astype('int64')

#lihat
dataset_ordinal.head()

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510       1   19            19000          0
1  15810944       1   35            20000          0
2  15668575       0   26            43000          0
3  15603246       0   27            57000          0
4  15804002       1   19            76000          0

In [25]:
dataset_ordinal['Gender'].unique()

array([1, 0], dtype=int64)

### One-hot Encoding

In [26]:
temp_dataset = pd.get_dummies(dataset_one_hot[['Gender']])

temp_dataset = pd.DataFrame(temp_dataset)

dataset_one_hot.drop('Gender', axis=1, inplace=True)

dataset_one_hot = dataset_one_hot.join(temp_dataset)
dataset_one_hot.head(5)

    User ID  Age  EstimatedSalary  Purchased  Gender_Female  Gender_Male
0  15624510   19            19000          0              0            1
1  15810944   35            20000          0              0            1
2  15668575   26            43000          0              1            0
3  15603246   27            57000          0              1            0
4  15804002   19            76000          0              0            1